/*******************************************************************************
 *  Copyright Statement:
 *  --------------------
 *  This software is protected by Copyright and the information contained
 *  herein is confidential. The software may not be copied and the information
 *  contained herein may not be used or disclosed except with the written
 *  permission of MediaTek Inc. (C) 2003
 *
 ******************************************************************************/

/*******************************************************************************
 * Filename:
 * ---------
 *  flashtool_handle.h
 *
 * Project:
 * --------
 *  Flash Download/Readback/Format Library.
 *
 * Description:
 * ------------
 *  The exported C interface APIs to deal with FlashTool handles.
 *
 * Author:
 * -------
 *  Amos Hsu (mtk00539)
 *
 *******************************************************************************/
 
#ifndef _FLASHTOOL_HANDLE_H_
#define _FLASHTOOL_HANDLE_H_

#include "mtk_mcu.h"
#include "mtk_status.h"
#include "mtk_resource.h"
#include "DOWNLOAD.H"
#include "host.h"

#ifdef  __cplusplus
extern "C" {
#endif

//------------------------------------------------------------------------------
// Boolean                                                                      
//------------------------------------------------------------------------------
typedef enum {
    _FALSE = 0,
    _TRUE = 1
} _BOOL;

//------------------------------------------------------------------------------
// prototype of remote file operation method callback                           
//------------------------------------------------------------------------------
typedef int (__stdcall *CALLBACK_REMOTE_GET_FILE_LEN)(const char *filepath, unsigned int * const p_file_length, void *user_arg);
typedef int (__stdcall *CALLBACK_REMOTE_READ_FILE)(const char *filepath, unsigned char * const p_file_content, unsigned int file_length, void *user_arg);
typedef int (__stdcall *CALLBACK_REMOTE_READ_FILE_BY_PACKAGE)(const char *filepath, U64 u64CntStartOffset, unsigned char * const p_file_content, unsigned int package_length, void *user_arg);


//------------------------------------------------------------------------------
// prototype of remote file's signature operation method callback                           
//------------------------------------------------------------------------------
typedef int (__stdcall *CALLBACK_REMOTE_GET_SIG_LEN)(const char *filepath, unsigned int * const p_sig_length, void *user_arg);
typedef int (__stdcall *CALLBACK_REMOTE_READ_SIG)(const char *filepath, unsigned char * const p_sig_content, unsigned int sig_length, void *user_arg);

//------------------------------------------------------------------------------
// prototype of customized file integrity check callback                        
//------------------------------------------------------------------------------
typedef int (__stdcall *CALLBACK_FILE_INTEGRITY_CHECK)(unsigned char * const p_file_content, unsigned int * const p_file_length, void *user_arg);

//------------------------------------------------------------------------------
// BL_HANDLE: Exported Functions                                                
//------------------------------------------------------------------------------
/* data structure used only by MT6516 combo mcp */
typedef struct {
    unsigned int  m_nand_id;
    unsigned int    m_emi_gen_a;
    unsigned int    m_emi_gen_b;
    unsigned int    m_emi_gen_c;
    unsigned int    m_emi_gen_d;
    unsigned int    m_emi_con_i;
    unsigned int    m_emi_con_j;
    unsigned int    m_emi_con_k;
    unsigned int    m_emi_con_l;
    unsigned int    m_emi_con_m;
    unsigned int    m_emi_con_n;
    unsigned int    m_emi_del_a;
    unsigned int    m_emi_del_b;
    unsigned int    m_emi_del_c;
    unsigned int    m_emi_del_d;
    unsigned int    m_emi_del_e;
    unsigned int    m_emi_del_f;
    unsigned int    m_emi_del_g;
    unsigned int    m_emi_del_h;
    unsigned int    m_emi_del_i;
    unsigned int    m_emi_del_j;
} EMI_SETTINGS_v05;

/* data structure used only by MT6573 combo mcp */
typedef struct {
    unsigned int m_nand_id;
    unsigned int m_emi_coni;
    unsigned int m_emi_drva;
    unsigned int m_emi_drvb;
    unsigned int m_emi_conj;
    unsigned int m_emi_conk;
    unsigned int m_emi_conl;
    unsigned int m_emi_iocl;
    unsigned int m_emi_gena;
    unsigned int m_emi_gend;
    unsigned int m_emi_drct;
    unsigned int m_emi_ppct;
    unsigned int m_emi_slct;
    unsigned int m_emi_abct;
    unsigned int m_emi_dutb;
} EMI_SETTINGS_v06;

/* data structure used only by MT6573 combo mcp */
typedef struct {
    unsigned int m_nand_id;
    unsigned int m_emi_coni;
    unsigned int m_emi_drva;
    unsigned int m_emi_drvb;
    unsigned int m_emi_conj;
    unsigned int m_emi_conk;
    unsigned int m_emi_conl;
    unsigned int m_emi_iocl;
    unsigned int m_emi_gena;
    unsigned int m_emi_gend;
    unsigned int m_emi_drct;
    unsigned int m_emi_ppct;
    unsigned int m_emi_slct;
    unsigned int m_emi_abct;
    unsigned int m_emi_dutb;
    unsigned int m_emi_conn;
} EMI_SETTINGS_v07;

#define MCP_MASK_DEV  0xFF00
#define MCP_MASK_RAM  0x00FF
#define MCP_DISC_RAM  0x0000 
#define MCP_NAND_DEV  0x0100
#define MCP_EMMC_DEV  0x0200
#define MCP_DDR1_RAM  0x0001
#define MCP_DDR2_RAM  0x0002
#define MCP_DDR3_RAM  0x0003
#define MCP_DISC_DDR1 MCP_DDR1_RAM
#define MCP_DISC_DDR2 MCP_DDR2_RAM
#define MCP_DISC_DDR3 MCP_DDR3_RAM
#define MCP_NAND_DDR1 (MCP_NAND_DEV | MCP_DDR1_RAM)
#define MCP_NAND_DDR2 (MCP_NAND_DEV | MCP_DDR2_RAM)
#define MCP_NAND_DDR3 (MCP_NAND_DEV | MCP_DDR3_RAM)
#define MCP_EMMC_DDR1 (MCP_EMMC_DEV | MCP_DDR1_RAM)
#define MCP_EMMC_DDR2 (MCP_EMMC_DEV | MCP_DDR2_RAM)
#define MCP_EMMC_DDR3 (MCP_EMMC_DEV | MCP_DDR3_RAM)
#define MCP_NAND_ID_LEN 5
#define MCP_EMMC_ID_LEN 9
typedef struct {
    unsigned int m_type;         /* 0x0000 : Invalid
                                    0x0001 : Discrete DDR1
                                    0x0002 : Discrete DDR2
                                    0x0003 : Discrete DDR3
                                    0x0101 : MCP(NAND+DDR1)
                                    0x0102 : MCP(NAND+DDR2)
                                    0x0103 : MCP(NAND+DDR3)
                                    0x0201 : MCP(eMMC+DDR1)
                                    0x0202 : MCP(eMMC+DDR2)
                                    0x0203 : MCP(eMMC+DDR3)
                                 */
    unsigned char m_id[12];
    int     m_emi_cona;             //@0x3000
    int     m_dramc_drvctl0;        //@0x40B8               -> customized TX I/O driving
    int     m_dramc_drvctl1;        //@0x40BC               -> customized TX I/O driving
    int     m_dramc_dle;            //40E4[4]:407c[6:4]     -> customized
    int     m_dramc_actim;          //@0x4000
    int     m_dramc_gddr3ctl;       //@0x40F4
    int     m_dramc_conf1;          //@0x4004
    int     m_dramc_ddr2ctl;        //@0x407C 
    int     m_dramc_test2_3;        //@0x4044
    int     m_dramc_conf2;          //@0x4008
    int     m_dramc_pd_ctrl;        //@0x41DC
    int     m_dramc_padctl3;        //@0x4014               -> customized TX DQS delay
    int     m_dramc_dqodly;         //@0x4200~0x420C        -> customized TX DQ delay
    int     m_dramc_addr_output_dly;// for E1 DDR2 only
    int     m_dramc_clk_output_dly; // for E1 DDR2 only
    int     m_reserved[10];

    union
    {
        struct _DDR1 
        {
            unsigned int m_mode;
            unsigned int m_ext_mode;    // dram driving strength -> customized
        } ddr1;
        struct _DDR2
        {
            unsigned int m_mode1;
            unsigned int m_mode2;
            unsigned int m_mode3;       // dram driving strength  -> customized
            unsigned int m_mode10;
            unsigned int m_mode63;
        } ddr2;
        struct
        {
            unsigned int m_mode0;
            unsigned int m_mode1;
            unsigned int m_mode2;
            unsigned int m_mode3;            
        } ddr3;        
    }u;    
} EMI_SETTINGS_v08;

/* For EMMC FW Check*/
typedef struct {
    unsigned int m_type;         /* 0x0000 : Invalid
                                    0x0001 : Discrete DDR1
                                    0x0002 : Discrete DDR2
                                    0x0003 : Discrete DDR3
                                    0x0101 : MCP(NAND+DDR1)
                                    0x0102 : MCP(NAND+DDR2)
                                    0x0103 : MCP(NAND+DDR3)
                                    0x0201 : MCP(eMMC+DDR1)
                                    0x0202 : MCP(eMMC+DDR2)
                                    0x0203 : MCP(eMMC+DDR3)
                                 */
    unsigned char m_id[12];
    int     m_emi_cona;             //@0x3000
    int     m_dramc_drvctl0;        //@0x40B8               -> customized TX I/O driving
    int     m_dramc_drvctl1;        //@0x40BC               -> customized TX I/O driving
    int     m_dramc_dle;            //40E4[4]:407c[6:4]     -> customized
    int     m_dramc_actim;          //@0x4000
    int     m_dramc_gddr3ctl;       //@0x40F4
    int     m_dramc_conf1;          //@0x4004
    int     m_dramc_ddr2ctl;        //@0x407C
    int     m_dramc_test2_3;        //@0x4044
    int     m_dramc_conf2;          //@0x4008
    int     m_dramc_pd_ctrl;        //@0x41DC
    int     m_dramc_padctl3;        //@0x4014               -> customized TX DQS delay
    int     m_dramc_dqodly;         //@0x4200~0x420C        -> customized TX DQ delay
    int     m_dramc_addr_output_dly;// for E1 DDR2 only
    int     m_dramc_clk_output_dly; // for E1 DDR2 only
	//Modification of  m_reserved[10];
	//int     m_reserved[10];
	int     DRAM_RANK_SIZE[4];
	int     m_reserved[2];
	char  m_emmc_fw_version[8];//For EMMC FW Version, Sandisk 6 byte, Others 1 byte
	//For EMMC: m_id_length = EMMC CID length(9 byte) + EMMC FW version bytes
	//For NAND: m_id_length = NAND ID length
	int     m_id_length;
	int     m_bloader_sub_version;

	union
    {
        struct _DDR1
        {
            unsigned int m_mode;
            unsigned int m_ext_mode;    // dram driving strength -> customized
        } ddr1;
        struct _DDR2
        {
            unsigned int m_mode1;
            unsigned int m_mode2;
            unsigned int m_mode3;       // dram driving strength  -> customized
            unsigned int m_mode10;
            unsigned int m_mode63;
        } ddr2;
        struct
        {
            unsigned int m_mode0;
            unsigned int m_mode1;
            unsigned int m_mode2;
            unsigned int m_mode3;
        } ddr3;
    }u;
} EMI_SETTINGS_v0801;

/* For NAND Extension */
typedef struct {
    unsigned int m_type;         /* 0x0000 : Invalid
                                    0x0001 : Discrete DDR1
                                    0x0002 : Discrete DDR2
                                    0x0003 : Discrete DDR3
                                    0x0101 : MCP(NAND+DDR1)
                                    0x0102 : MCP(NAND+DDR2)
                                    0x0103 : MCP(NAND+DDR3)
                                    0x0201 : MCP(eMMC+DDR1)
                                    0x0202 : MCP(eMMC+DDR2)
                                    0x0203 : MCP(eMMC+DDR3)
                                 */
    unsigned char m_id[12];
	unsigned int m_id_number;
	unsigned int m_bloader_sub_version;
    unsigned int m_emi_coni;
    unsigned int m_emi_drva;
    unsigned int m_emi_drvb;
    unsigned int m_emi_conj;
    unsigned int m_emi_conk;
    unsigned int m_emi_conl;
    unsigned int m_emi_iocl;
    unsigned int m_emi_gena;
    unsigned int m_emi_gend;
